app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "description" = ?, "status" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "its good for yours health take a walk every day to stay healthy"], ["status", nil], ["priority", nil], ["updated_at", "2023-03-26 11:30:02.738943"], ["id", 2]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def destroy
        user.todos.find(params[:id]).destroy

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 2]]
---
    def index
        todos = user.todos.all